{
  "name": "EaselJS",
  "version": "0.0.0",
  "homepage": "https://github.com/CreateJS/EaselJS",
  "authors": [
    "gskinner",
    "lannymcnie",
    "mikechambers",
    "wdamien"
  ],
  "description": "The Easel Javascript library provides a full, hierarchical display list, a core interaction model, and helper classes to make working with the HTML5 Canvas element much easier. Part of the CreateJS suite of libraries.",
  "main": "lib/easeljs-0.7.1.combined.js",
  "keywords": [
    "easeljs",
    "html5",
    "canvas",
    "spritesheet",
    "createjs"
  ],
  "license": "MIT",
  "ignore": [
    "**/.*",
    "node_modules",
    "bower_components",
    "build",
    "docs",
    "examples",
    "src",
    "tutorials"
  ],
  "gitHead": "14eb78900b939d10031feb9a050b0290e8a67f37",
  "readme": "# EaselJS\n\nEaselJS is a library to make working with the Canvas element easier. It provides a display list to allow you to work with display elements on a canvas as nested objects. It also provides a simple framework for providing shape based mouse interactions on elements in the display list. This is useful for games, generative art, and other highly graphical experiences.\n\n## Simple Example\n\n\t//Draw a square on screen.\n\tvar canvas = document.getElementById('canvas');\n\tvar stage = new createjs.Stage(canvas);\n\tvar shape = new createjs.Shape();\n\tshape.graphics.beginFill('rgba(255,0,0,1)').drawRoundRect(0, 0, 120, 120, 10);\n\tstage.addChild(shape);\n\tstage.update();\n\n## Animation Example\n\tvar ss = new createjs.SpriteSheet({\n\t\t\"frames\": {\n\t\t\t\"width\": 200,\n\t\t\t\"numFrames\": 64,\n\t\t\t\"regX\": 2,\n\t\t\t\"regY\": 2,\n\t\t\t\"height\": 361\n\t\t},\n\t\t\"animations\": {\"jump\": [26, 63], \"run\": [0, 25]},\n\t\t\"images\": [\"./assets/runningGrant.png\"]\n\t});\n\t\n\tss.getAnimation(\"run\").speed = 2;\n\tss.getAnimation(\"run\").next = \"jump\";\n\tss.getAnimation(\"jump\").next = \"run\";\n\t\n\tvar sprite = new createjs.Sprite(ss, \"run\");\n\tsprite.scaleY = sprite.scaleX = 0.4;\n\t\n\tcreatejs.Ticker.setFPS(60);\n\tcreatejs.Ticker.addEventListener(\"tick\", stage);\n\tstage.addChild(sprite);\n\n\n## Support and Resources\n* Find examples and more information at the [EaselJS web site](http://easeljs.com/)\n* Read the [documentation](http://createjs.com/Docs/EaselJS)\n* Post questions and interact with other users at our [Community](http://community.createjs.com) site.\n* There is a [Google Group](http://groups.google.com/group/createjs-discussion) for discussions and support.\n* Have a look at the included [examples](https://github.com/CreateJS/EaselJS/tree/master/examples) and [API documentation](http://createjs.com/Docs/EaselJS/) for more in-depth information.\n\nIt was built by [gskinner.com](http://www.gskinner.com), and is released for free under the MIT license, which means you\ncan use it for almost any purpose (including commercial projects). We appreciate credit where possible, but it is not a requirement.\n\n\n## Classes\n\nThe API is inspired by Flash's display list, and should be easy to pick up for both JS and AS3 developers. Check out the [docs](http://createjs.com/Docs/EaselJS/) for more information.\n\n**DisplayObject**\nAbstract base class for all display elements in EaselJS. Exposes all of the display properties (ex. x, y, rotation, scaleX, scaleY, skewX, skewY, alpha, shadow, etc) that are common to all display objects.\n\n**Stage**\nThe root level display container for display elements. Each time tick() is called on Stage, it will update and render the display list to its associated canvas.\n\n**Container**\nA nestable display container, which lets you aggregate display objects and manipulate them as a group.\n\n**Bitmap**\nDraws an image, video or canvas to the canvas according to its display properties.\n\n**Sprite**\nDisplays single frames or animations from sprite sheets, and provides APIs for managing playback and sequencing.\n\n**Shape**\nRenders a Graphics object within the context of the display list.\n\n**Graphics**\nProvides an easy to use API for drawing vector data. Can be used with Shape, or completely stand alone.\n\n**Text**\nRenders a single line of text to the stage.\n\n**DOMElement**\nAn experimental display object that allows you to manage an HTML element as a part of the display list.\n\n**Filter**\nThe base filter class that other filters (ex. BlurFilter, ColorMatrixFilter, etc) extend.\n\n\nThere are also a few helper classes included:\n\n**Shadow**\nDefines all of the properties needed to display a shadow on a display object.\n\n**Ticker**\nProvides a pausable centralized tick manager for ticking Stage instances or other time based code.\n\n**UID**\nVery simple class that provides global, incremental unique numeric IDs.\n\n**SpriteSheet**\nEncapsulates all the data associated with a sprite sheet to be used with Sprite.\n\n**SpriteSheetUtils**\nContains utility methods for extending existing sprite sheets with flipped frames and extracting individual frames.\n\n**SpriteSheetBuilder**\nBuild a bitmap SpriteSheet from vector graphics at run time. Get the filesize savings of vector, with the performance\nof a SpriteSheet.\n\n**Matrix2D**\nRepresents a 3x3 affine transformation matrix. Used internally for calculating concatenated transformations.\n\n**Rectangle**\nRepresents a rectangle as defined by the points (x, y) and (x+width, y+height).\n\n**Point**\nRepresents a point on a 2 dimensional x / y coordinate system.",
  "readmeFilename": "README.md",
  "_id": "EaselJS@0.7.1",
  "commit": "14eb78900b939d10031feb9a050b0290e8a67f37",
  "repository": {
    "type": "git",
    "url": "git://github.com/CreateJS/EaselJS"
  }
}